Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/db-omegat.tmx
Source language: en_us
Languages: pt_br

source: New Database Connection...
pt_br: Nova Conexão com banco de dados...

source: Debug mode
pt_br: Modo depuração

source: Whether or not "invisible" database queries should be logged.
pt_br: Se queries do banco de dados "invisivel" deveriam ser logadas ou não.

source: Databases
pt_br: Banco de dados

source: Unable to read the database structure,
pt_br: Incapaz de ler a estrutura do banco de dados,

source: Enable Debug
pt_br: Habilitar debug

source: Disable Debug
pt_br: Desabilitar debug

source: New Driver...
pt_br: Novo driver...

source: Remove Driver
pt_br: Remover driver

source: Customize
pt_br: Personalizar

source: Test Driver...
pt_br: Testar driver...

source: New Connection...
pt_br: Nova conexão...

source: Connect...
pt_br: Conectar...

source: Connect As...
pt_br: Conectar como...

source: Connect Using...
pt_br: Conectar utilizando...

source: Disconnect
pt_br: Desconectar

source: Remove Connection
pt_br: Remover conexão

source: Capture Database Schema...
pt_br: Captura de Esquema do Banco de Dados...

source: Create Table...
pt_br: Criar Tabela...

source: Grab Structure...
pt_br: Capturar Extrutura...

source: Recreate Table...
pt_br: Recriar Tabela...

source: Paste Table...
pt_br: Colar Tabela...

source: Add Column...
pt_br: Adicionar Coluna...

source: Paste Column...
pt_br: Colar Coluna...

source: Add Index...
pt_br: Adicionar Índice...

source: Index
pt_br: Índice

source: Remove Index
pt_br: Remover Índex

source: Create View...
pt_br: Criar Visão...

source: Remove View
pt_br: Remover Visão

source: Create Procedure...
pt_br: Criar Procedure...

source: Remove Procedure
pt_br: Remover Procedure

source: Refresh
pt_br: Atualizar

source: View Data...
pt_br: Visualizar Dados...

source: Execute Command...
pt_br: Executar Comando...

source: Design Query...
pt_br: Criar Consulta...

source: Adaptor class
pt_br: Classe adaptadora

source: Class of adaptor used
pt_br: Classe do adaptador utilizado

source: {0} [{1} on {2}]
pt_br: {0} [{1} em {2}]

source: Default schema
pt_br: Esquema Padrão

source: Database URL
pt_br: URL do Banco de Dados

source: URL of connected database
pt_br: URL do banco de dados conectado

source: Driver File(s)
pt_br: Arquivo(s) de Driver

source: Database driver
pt_br: Driver do Banco de Dados

source: Database URL prefix
pt_br: Prefixo da URL do Banco de Dados

source: Template for URL of database connection (for convenience)
pt_br: Modelo de URL para conexão com banco de dados (para conveniência)

source: User
pt_br: Usuário

source: Active user
pt_br: Usuário ativo

source: Read only
pt_br: Somente leitura

source: Read only database
pt_br: Banco de dados somente leitura

source: GROUP BY support
pt_br: Suporta GROUP BY

source: OUTER JOIN support
pt_br: Suporta OUTER JOIN

source: UNION support
pt_br: Suporta UNION

source: Database product name
pt_br: Nome do produto do Banco de dados

source: Database version
pt_br: Versão do banco de dados

source: Remember password
pt_br: Lembrar senha

source: Catalog
pt_br: Catálogo

source: Schema
pt_br: Esquema

source: Column type
pt_br: Tipo de coluna

source: Notes
pt_br: Observações

source: Type
pt_br: Tipo

source: Nulls allowed
pt_br: NULL permitido

source: Data type
pt_br: Tipo de dado

source: Default value
pt_br: Valor padrão

source: Column size
pt_br: Tamanho da coluna

source: Decimal digits
pt_br: Digitos decimais

source: Position
pt_br: Posição

source: &Unique
pt_br: &Única

source: Unique
pt_br: Única

source: Qualifier
pt_br: Qualificador

source: Filter
pt_br: Filtro

source: Primary catalog
pt_br: Catálogo primário

source: Primary schema
pt_br: Esquema primário

source: Primary table
pt_br: Tabela primária

source: Primary column
pt_br: Coluna primária

source: Column
pt_br: Coluna

source: Select this checkbox to mark the index as unique.
pt_br: Selecione este checkbox para marcar o índice como único.

source: Procedures are callable
pt_br: Procedimentos são chamados

source: Tables are selectable
pt_br: Tabelas são selecionadas

source: Local files
pt_br: Arquivos locais

source: Local files per table
pt_br: Arquivos locais por tabela

source: Mixed-case identifiers
pt_br: Identificadores caso-Misto

source: Mixed-case quoted identifiers
pt_br: Identificadores cotados caso-Misto

source: Alter table with add column
pt_br: Alterar tabela com adição de coluna

source: Alter table with drop column
pt_br: Alterar tabela com exclusão de coluna

source: Column aliasing
pt_br: Apelidando coluna

source: Null plus null is null
pt_br: Nulo mais nulo é nulo

source: Convert
pt_br: Converter

source: Table correlation names
pt_br: Correlação de nome da tabela

source: Different table correlation names
pt_br: Correlação de nomes em tabelas diferentes

source: Expressions in order by
pt_br: Expressões em order by

source: Unrelated order by
pt_br: Order by não relacionado

source: Group by support
pt_br: Suporte á Group by

source: Unrelated group by support
pt_br: Suporte á group by não relacionado

source: Group by beyond select
pt_br: Group by além do select

source: Like escape clause
pt_br: Cláusula Like

source: Multiple result sets
pt_br: Result sets múltiplos

source: Multiple transactions
pt_br: Transações múltiplas

source: Non-nullable columns
pt_br: Colunas não-nulas

source: Minimal SQL grammar
pt_br: Gramática SQL mínima

source: Core SQL grammar
pt_br: Gramática SQL de Núcleo

source: Extended SQL grammar
pt_br: Gramática SQL Extendida

source: ANSI 92 entry level SQL
pt_br: SQL nível básico ANSI 92

source: ANSI 92 intermediate level SQL
pt_br: SQL nível intermediário ANSI 92

source: ANSI 92 full level SQL
pt_br: SQL nível total ANSI 92

source: Integrity enhancements facility
pt_br: Facilitadores de integração

source: Full outer joins
pt_br: Outer joins completos

source: Limited outer joins
pt_br: Outer joins limitados

source: Catalog at start
pt_br: Catálogo no início

source: Schemas in DML
pt_br: Esquemas em DML

source: Schemas in procedure calls
pt_br: Esquemas chamadas de procedure

source: Schemas in table definitions
pt_br: Esquemas em definições de tabela

source: Schemas in index calls
pt_br: Esquemas em chamadas de indíce

source: Schemas in privilege calls
pt_br: Esquemas em chamadas de privilégio

source: Catalogs in DML
pt_br: Catálogos em DML

source: Catalogs in procedure calls
pt_br: Catálogos em chamadas de procedure

source: Catalogs in table definitions
pt_br: Catálogos em definições de tabela

source: Catalogs in index definitions
pt_br: Catálogos em definições de índice.

source: Catalogs in privilege definitions
pt_br: Catálogos em definições de privilégio

source: Positioned delete
pt_br: Delete posicionado

source: Positioned update
pt_br: Update posicionado

source: Stored procedures supported
pt_br: Stored procedures suportado

source: Subqueries in comparisions
pt_br: Comparações em subconsultas

source: Subqueries in exists
pt_br: Exists em Subconsultas

source: Subqueries in inserts
pt_br: Inserts em subconsultas

source: Subqueries in quantifieds
pt_br: Quantificadores em subconsultas

source: Correlated sunbqueries
pt_br: Subconsultas correlacionadas

source: Union support
pt_br: Suporte a union

source: Union all support
pt_br: Suporte a union all

source: Open cursors across commit
pt_br: Abrir cursores através de commit

source: Open cursors across rollback
pt_br: Abrir cursores através de rollback

source: Open statements across commit
pt_br: Abrir sentenças através de commit

source: Open statements across rollback
pt_br: Abrir sentenças através de rollback

source: Max rowsize includes BLOBs
pt_br: Tamanha máximo de linha inclui BLOBs

source: Transaction support
pt_br: Suporte a Transação

source: DDL and DML in transactions
pt_br: DDL e DML em transações

source: DML only
pt_br: Somente DML

source: DDL causes commit
pt_br: DDL causa commit

source: DDL ignored in transactions
pt_br: DDL ignorado em transações

source: Batch updates
pt_br: Updates por lote

source: Null sort
pt_br: Classificado Nulo

source: Identifier store
pt_br: Identificador armazenado

source: Quoted identifier store
pt_br: Indentificador armazenado marcado

source: Max binary literal search
pt_br: Máximo de um literal binário na busca

source: Max character literal search
pt_br: Máximo de um literal caracter na busca

source: Max column name search
pt_br: Máximo de um nome de coluna na busca

source: Max columns group by
pt_br: Máximo de colunas no group by

source: Max columns in index
pt_br: Máximo de colunas em um indíce

source: Max columns order by
pt_br: Máximo de colunas no order by

source: Max columns in select
pt_br: Máximo de colunas em um select

source: Max columns in table
pt_br: Máximo de colunas em uma tabela

source: Max connections
pt_br: Máximo de conexões

source: Max cursor name length
pt_br: Tamanho máximo do nome de cursor

source: Max index length
pt_br: Tamanho máximo de índice

source: Max schema name length
pt_br: Tamanho máximo do nome de esquema

source: Max procedure name length
pt_br: Tamanho máximo do nome de procedure

source: Max catalog name length
pt_br: Tamanho máximo do nome de catálogo

source: Max row size
pt_br: Tamanho máximo da linha

source: Max statement length
pt_br: Tamanho máximo de comando

source: Max statements
pt_br: Máximo de comandos

source: Max table name length
pt_br: Tamanho máximo de nome de tabela

source: Max tables in select
pt_br: Máximo de tabelas em um select

source: Max user name length
pt_br: Tamanho máximo do nome de usuário

source: Max transaction isolation
pt_br: Isolação de transação máxima

source: Driver name
pt_br: Nome do driver

source: Driver version
pt_br: Versão do driver

source: Driver major version
pt_br: Maior versão do driver

source: Driver minor version
pt_br: Menor versão do driver

source: Identifier quoted string
pt_br: Identificadores marcados de string

source: SQL keywords
pt_br: Palavras chave SQL

source: Numeric functions
pt_br: Funções numéricas

source: String functions
pt_br: Funções de texto

source: System functions
pt_br: Funções de sistema

source: Time and date functions
pt_br: Funções de data e tempo

source: Search string escape
pt_br: Busca por string

source: Extra name characters
pt_br: Caracteres nome extra

source: Schema term
pt_br: Termo esquema

source: Procedure term
pt_br: Termo procedimento

source: Catalog term
pt_br: Termo catálogo

source: Catalog separator
pt_br: Separador catálogo

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Procedures query
pt_br: Consultar Procedures

source: Procedure columns query
pt_br: Consultar parâmetros de Procedure

source: Schemas query
pt_br: Consultar esquemas

source: Catalogs query
pt_br: Consultar catálogos

source: Tables query
pt_br: Consultar tabelas

source: Field types query
pt_br: Consultar tipos de campos

source: Columns query
pt_br: Consultar colunas

source: Column privileges query
pt_br: Consultar privilégios da coluna

source: Table privileges query
pt_br: Consultar privilégios da tabela

source: Best row identifier query
pt_br: Consultar melhor identificador de coluna

source: Version columns query
pt_br: Consultar versão das colunas

source: Primary keys query
pt_br: Consultar chaves primárias

source: Imported keys query
pt_br: Consultar chaves importadas

source: Exported keys query
pt_br: Consultar chaves exportadas

source: Cross reference query
pt_br: Consultar referências cruzadas

source: Type info query
pt_br: Consultar informação de Tipo

source: Index info query
pt_br: Consultar informação de índice

source: User-defined types query
pt_br: Consultar tipos definidos por usuário

source: Capitalize username
pt_br: Usuário em maiúsculo

source: New JDBC Driver
pt_br: Novo Driver JDBC

source: &Driver File(s):
pt_br: &Arquivos de Driver:

source: Driver &Class:
pt_br: &Classe do Driver:

source: &Name:
pt_br: &Nome:

source: &Add...
pt_br: &Adicionar...

source: &Remove
pt_br: &Remover

source: &Find
pt_br: &Localizar

source: Searching for driver classes...
pt_br: Procurando por classes de driver...

source: Searching for driver classes finished
pt_br: Procura por classes de driver finalizada...

source: New JDBC driver dialog.
pt_br: Dialog para novo driver JDBC.

source: Driver files.
pt_br: Arquivos de Driver.

source: Driver files list box
pt_br: Lista com arquivos de driver.

source: Driver class.
pt_br: Classe de driver.

source: Driver class combo box
pt_br: Caixão de seleção com classes de driver

source: Name of the driver.
pt_br: Nome do driver.

source: Driver text field
pt_br: Campo texto do driver

source: New Driver dialog description
pt_br: Descrição da dialog do novo Driver

source: Add driver file.
pt_br: Adicionar arquivo de driver.

source: Remove driver file.
pt_br: Remover arquivo de driver.

source: Find driver class.
pt_br: Localizar classe de driver.

source: Searching for driver classes progress bar
pt_br: Barra de progresso da procura por classes de driver...

source: Progress bar showing the progress of searching for the driver classes.
pt_br: Barra de progresso demostrando o progresso da procura por classes de driver.

source: driver file
pt_br: arquivo do driver

source: driver class
pt_br: classe do driver

source: Unable to register the JDBC driver.
pt_br: Incapaz de registrar o driver JDBC.

source: The following information is missing: {0}.
pt_br: A seguinte informação esta faltando: {0}.

source: Please specify it.
pt_br: Por favor especifique.

source: Select Driver
pt_br: Selecione um Driver

source: Archive Files (*.jar, *.zip)
pt_br: Arquivos de Compressão (*.jar, *.zip)

source: Are you sure you want to remove the selected driver?
pt_br: Tem certeza que deseja remover o driver selecionado?

source: Unable to remove driver,
pt_br: Incapaz de remover driver,

source: Are you sure you want to remove the selected connection?
pt_br: Tem certeza que deseja remover a conexão selecionada?

source: Unable to remove connection,
pt_br: Incapaz de remover conexão,

source: New Database Connection
pt_br: Nova Conexão do Banco de Dados

source: D&atabase URL:
pt_br: URL do B&anco de Dados:

source: &User Name:
pt_br: &Nome do Usuário:

source: &Password:
pt_br: &Senha:

source: <html>&Remember password<br>(see help for information on security risks)</html>
pt_br: <html>&Lembrar senha<br>(verifique ajuda para informações sobre riscos de segurança)</html>

source: Connection name.
pt_br: Nome da conexão.

source: Connection name combo box
pt_br: Caixa de seleção com o nome de conexão

source: Combo box containing all connection names.
pt_br: Caixa de seleção contendo todas os nomes de conexão.

source: Combo box containing all driver classes.
pt_br: Caixa de seleção contendo todas as classes de driver.

source: Database URL.
pt_br: URL do Banco de Dados.

source: Database URL text field
pt_br: Campo texto da URL do banco de dados

source: Database user name.
pt_br: Nome do usuário do banco de dados.

source: Database user name text field
pt_br: Campo texto do nome do usuário do banco de dados

source: Database password.
pt_br: Senha do banco de dados.

source: Database password text field
pt_br: Campo texto da senha do banco de dados

source: Select this checkbox to remember the password.
pt_br: Selecione este checkbox para lembrar a senha.

source: New database connection tab panel
pt_br: Aba do Painel para nova conexão com banco de dados

source: Tab panel with new database connection parameters
pt_br: Aba do painel com os parâmetros para nova conexão com banco de dados

source: &Table name:
pt_br: &Nome da Tabela:

source: Untitled
pt_br: Sem título

source: &Owner:
pt_br: &Dono:

source: Columns
pt_br: Colunas

source: A&dd column
pt_br: A&dicionar coluna

source: Create Table
pt_br: Criar Tabela

source: Table name.
pt_br: Nome da Tabela.

source: Table name text field
pt_br: Campo texto do nome da tabela

source: Owner of this table.
pt_br: Dono desta tabela.

source: Owner combo box
pt_br: Caixa de seleção do dono

source: Combo box containing all available owners.
pt_br: Caixa de seleção contendo todos os donos disponíveis.

source: Table of columns
pt_br: Tabela de colunas

source: Table of columns and their parameters.
pt_br: Tabela de colunase seus parâmetros.

source: Add column to the table.
pt_br: Adicionar coluna para a tabela.

source: Remove column from the table.
pt_br: Remover coluna da tabela.

source: Create table dialog.
pt_br: Dialog para criação de tabela.

source: Key
pt_br: Chave

source: Null
pt_br: Nulo

source: Column name
pt_br: Nome da coluna

source: Size
pt_br: Tamanho

source: Scale
pt_br: Escala

source: Comment
pt_br: Comentário

source: Check constraint
pt_br: Regra check

source: None
pt_br: Nenhum

source: Up
pt_br: Subir

source: Down
pt_br: Descer

source: Add Column
pt_br: Adicionar Coluna

source: &Type:
pt_br: &Tipo:

source: &Size:
pt_br: &Tamanho:

source: Sc&ale:
pt_br: Esc&ala:

source: &Default:
pt_br: &Padrão:

source: Constraints
pt_br: Regras

source: &Primary key
pt_br: &Chave primária

source: Nu&ll
pt_br: Nu&li

source: &Index:
pt_br: &Índice:

source: Column name.
pt_br: Nome da coluna.

source: Column name text field
pt_br: Campo texto do nome da coluna

source: Column type.
pt_br: Tipo de coluna.

source: Column type combo box
pt_br: Caixa de seleção do tipo de coluna

source: Combo box containing all column types.
pt_br: Caixa de seleção contendo todos os tipos de coluna.

source: Column size.
pt_br: Tamanho da coluna.

source: Column size text field
pt_br: Campo texto do tamanho da coluna

source: Column scale.
pt_br: Escala da coluna.

source: Column scale text field
pt_br: Campo texto da escala da coluna

source: Default column value.
pt_br: Valor padrão da coluna.

source: Default column value text field
pt_br: Campo texto do valor padrão da coluna

source: Select this checkbox to mark the column as primary key.
pt_br: Selecione este checkbox para marcar a coluna como chave primária.

source: Select this checkbox to mark the column as unique.
pt_br: Selecione este checkbox para marcar a coluna como única.

source: Select this checkbox to allow null values for this column.
pt_br: Selecione este checkbox para permitir valores nulos para esta coluna.

source: Select this checkbox to add the column to an existing index or create a new one.
pt_br: Selecione este checkbox para adicionar a coluna para um índice existente ou criar um nome.

source: Index combo box
pt_br: Caixa de seleção do Índice

source: Combo box containing all available indexes.
pt_br: Caixa de seleção contendo todas os índices disponíveis.

source: Select this checkbox to add constraints to the column.
pt_br: Selecione este checkbox para adicionar regras para a coluna.

source: Constraints text area
pt_br: Área de texto das regras

source: Set constraints for the column in this text area.
pt_br: Informar as regras para a coluna nesta área de texto.

source: Add column dialog.
pt_br: Dialog para Adicionar coluna.

source: Drop Table
pt_br: Excluir Tabela

source: Unable to drop table, {0}
pt_br: Incapaz de excluir tabela, {0}

source: Drop Index
pt_br: Excluir Índice

source: Unable to drop index,
pt_br: Incapaz de excluir índice,

source: Remove Column
pt_br: Remover Coluna

source: Unable to remove column,
pt_br: Incapaz de remover coluna,

source: Drop Procedure
pt_br: Excluir Procedure

source: Unable to drop procedure,
pt_br: Incapaz de excluir procedure,

source: Add Index
pt_br: Adicionar Índice

source: &Index name:
pt_br: &Nome do Índex:

source: Select the items you want to add to the index:
pt_br: Selecione os itens que deseja adicionar no índice.

source: Add Index Dialog
pt_br: Dialog para Adicionar Índice

source: Add index dialog.
pt_br: Dialog para adicionar índice.

source: Name of the index.
pt_br: Nome do índice.

source: Index name text field
pt_br: Campo texto do nome do índice

source: Add To Index
pt_br: Adicionar Para Índice

source: Column:
pt_br: Coluna:

source: Available columns combo box
pt_br: Caixa de seleção das colunas disponíveis

source: Combo box containing all available columns.
pt_br: Caixa de seleção contendo todas as colunas disponíveis.

source: Add to index dialog.
pt_br: Dialog para adicionar índice.

source: Create View
pt_br: Criar Visão

source: &View name:
pt_br: &Nome da Visão:

source: &SQL expression to create view:
pt_br: Expressão &SQL para criar visão:

source: {0} does not support views.
pt_br: {0} não suporta visões.

source: Name of the view.
pt_br: Nome da visão.

source: SQL expression to create view.
pt_br: Expressão SQL para criar visão:

source: SQL expression text area
pt_br: Área de texto da expressão SQL

source: Create view dialog.
pt_br: Dialog para criar visão.

source: Grab Table
pt_br: Capturar Tabela

source: Grabbing table structure.
pt_br: Capturando estrutura da tabela.

source: Database structure files
pt_br: Arquivos de estrutura do banco de dados

source: File {0} already exists.
pt_br: Arquivo {0} já existe.

source: Do you want to replace it?
pt_br: Deseja atualizar?

source: Recreate Table
pt_br: Recriar Tabela

source: Name the table
pt_br: Nome da tabela

source: &Create table script:
pt_br: Script de &criação de tabela:

source: &Edit table script
pt_br: &Editar script da tabela

source: &Reload table script from file
pt_br: &Recarregar script da table a partir de arquivo

source: Table Name
pt_br: Nome da Tabela

source: Create table script.
pt_br: Criar script de tabela.

source: Table Script
pt_br: Script de Tabela

source: SQL command to create this table.
pt_br: Comando SQL para criar esta tabela.

source: Click to edit SQL command to create this table.
pt_br: Clique para editar o comando SQL de criação da tabela.

source: Click to reload table script from file.
pt_br: Clique para recarregar script da table a partir de arquivo.

source: Recreate table dialog.
pt_br: Dialog para recriar tabela.

source: Command Editor
pt_br: Editor de Comandos

source: Command successfully executed.
pt_br: Comando executado com sucesso.

source: The Database Explorer just completed a fetch of {0} records.
pt_br: O Banco de Dados Explorer acabou de retornar {0} registros.

source: Clicking "Yes" will fetch the next {1} records.
pt_br: Clicando em "Sim" irá retornar os próximos {1} registros.

source: Do you wish to continue?
pt_br: Deseja continuar?

source: &No
pt_br: &Não

source: &Yes
pt_br: &Sim

source: Fetch &all
pt_br: Recuperar &todosl

source: Unable to execute query,
pt_br: Incapaz de executar consulta,

source: &Execute
pt_br: &Executar

source: Fetch Data
pt_br: Recuperar Dado

source: Unable to show data, {0}
pt_br: Incapaz de apresentar dado, {0}

source: Command editor window
pt_br: Janela editor de comando

source: Fetch all
pt_br: Recuperar todos

source: SQL command text area
pt_br: Área de texto de comando SQL

source: SQL command to execute.
pt_br: Comando SQL para executar

source: SQL command combo box
pt_br: Caixa de selação de comando SQL

source: Combo box containing all recent SQL commands.
pt_br: Caixa de seleção contendo todas os comandos SQL recentes.

source: Execute SQL command.
pt_br: Executar Comando SQL.

source: SQL query results
pt_br: Resultados da consulta SQL

source: SQL query results.
pt_br: Resultados da consulta SQL.

source: Command
pt_br: Comando

source: &Command:
pt_br: &Comando:

source: Command history
pt_br: Histórico de comando

source: Co&mmand history:
pt_br: Histórico de co&mando:

source: Results
pt_br: Resultados

source: &Results:
pt_br: &Resultados:

source: Command status
pt_br: Estado do comando

source: Command is running...
pt_br: Comando está rodando...

source: Command failed.
pt_br: Comando falhou.

source: Multiple Objects Flavor
pt_br: Sabor de Multiplos Objetos

source: Unable to refresh children,
pt_br: Incapaz de atualizar dependente,
